#dotfiles
brew "yadm"

#Version managers
brew "rbenv"
brew "tfenv"

#AWS tools
brew "awscli"
brew "aws-cdk"
cask "aws-vault"

#Local dev
#older version of vagratn installed manually
#cask "vagrant"
#older version of virtualbox installed manually
#cask "virtualbox"
cask "visual-studio-code"
cask "docker"
brew "packer"

#k8s
brew "kubectl"
brew "minikube"

# Browsers
cask "firefox"
cask "google-chrome"

#Make like linux
cask "xquartz"
brew "dmenu"
brew "zenity"
cask "gpg-suite"
brew "tmux"

