#dotfiles
brew "yadm"

#Version managers
brew "rbenv"
brew "tfenv"

#AWS tools
brew "awscli"
brew "aws-cdk"
cask "aws-vault"
cask "session-manager-plugin"
brew "awslogs"

# low-level system things
# HoRNDIS allows usb tethering with android phones
cask "horndis"

# nerd   tooling
cask "kitty"
brew "jq"
brew "bash-completion"

#Local dev
cask "visual-studio-code"
brew "packer"
brew "composer"
cask "atom"
brew "vim"
brew "gh"

#VMs
#older version of vagratn installed manually
#cask "vagrant"
#older version of virtualbox installed manually
#cask "virtualbox"


##containers
cask "docker"
brew "docker-completion"
brew "docker-compose-completion"
brew "kubectl"
brew "minikube"
brew "helm"
brew "kube-ps1"

# net tooling
brew "wrk"
brew "httpstat"
brew "speedtest-cli"

# comms
# slack
cask "krisp"

# Browsers
cask "firefox"
cask "google-chrome"

#Make like linux
cask "xquartz"
brew "dmenu"
brew "zenity"
cask "gpg-suite"
brew "tmux"
brew "watch"
brew "telnet"
brew "wget"
